Yusugarzjh/Yu_msp432/真源码/my_source.h
/*
 * variable.h
 *
 *  Created on: 2022年5月23日
 *      Author: Yu-sugar
 */

#ifndef MY_SOURCE_H_
#define MY_SOURCE_H_
#include <stdlib.h>
#include <ti/devices/msp432p4xx/inc/msp432.h>
#include "stdio.h"
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include "i2c_driver.h"
#include "demo_sysctl.h"
#include "bmi160_support.h"
#include "uart_driver.h"
#include "opt3001.h"
BMI160_RETURN_FUNCTION_TYPE returnValue;
// BMI160/BMM150
struct bmi160_gyro_t        s_gyroXYZ;
struct bmi160_accel_t       s_accelXYZ;
struct bmi160_mag_xyz_s32_t s_magcompXYZ;
//Calibration off-sets
int8_t accel_off_x;
int8_t accel_off_y;
int8_t accel_off_z;
s16 gyro_off_x;
s16 gyro_off_y;
s16 gyro_off_z;
uint16_t gyroAbsX, gyroAbsY, gyroAbsZ;
uint16_t deltaAccelX, deltaAccelY, deltaAccelZ;
int16_t prevAccelX = 0;
int16_t prevAccelY = 0;
int16_t prevAccelZ = 0;
int16_t prevGyroX = 0;
int16_t prevGyroY = 0;
int16_t prevGyroZ = 0;
int16_t stillCount = 0;
int32_t gyroAvgX = 0.0;
int32_t gyroAvgY = 0.0;
int32_t gyroAvgZ = 0.0;
int32_t accelAvgX = 0.0;
int32_t accelAvgY = 0.0;
int32_t accelAvgZ = 0.0;
bool BME_on = true;
#define  OLED_GAME
//#define  NORMAL_MAP
//#define  TEST_MAP
// OPT3001
uint16_t rawData;
float     convertedLux;
#define  MAPX_MAX 4
#define  MAPY_MAX 7
bool BMI_on = true;
int i_axle,j_axle;
int GameRecord=0;//保存的游戏记录
int mymap[MAPX_MAX][MAPY_MAX]=           //定义一个8x8的地图，用数组表示各单元格元素
{
  {5,4,3,0,0,0,1},//5 person
  {0,0,0,0,0,0,1},//7virus+vaccine
  {0,0,0,0,0,0,1},//8person+vaccine
  {0,0,0,0,0,0,1},

  };
int PersonX,PersonY,stick_x=68,stick_y=32;
int BarX=114,BarY=64,GameState=0,TimerInterval=1;//进度条相关
void Progress_Bar()
{
            sensorOpt3001Read(&rawData);
            sensorOpt3001Convert(rawData, &convertedLux);
            int BarSpeed;
            snprintf(test.txString, 60,
                    "{\"light\":{\"lux\":%d}}\r\n",
                    abs(convertedLux));
            sendTextPc();
            sendTextEsp();
            if(abs(convertedLux)<300)
                BarSpeed=10;
            else if(abs(convertedLux)<1000)
                BarSpeed=5;
            else
                BarSpeed=1;
            TimerInterval++;
            if(TimerInterval%BarSpeed==0)
            {
//                UART_transmitData(EUSCI_A0_BASE, BarY--);
                BarY-=2;
                LCD_draw_line(BarX,BarY,BarX+16,BarY,GREEN);
            }
}
void paint()             //绘制初始地图
{
 for( i_axle=0;i_axle<MAPX_MAX;i_axle++)
   { for( j_axle=0;j_axle<MAPY_MAX;j_axle++)
       {
           switch(mymap[i_axle][j_axle])
           {
             #ifdef   OLED_GAME
//             case 0:LCD_P16X16Str(j_axle,i_axle, "墙", HUI, PINK);break;
             case 1:LCD_P16X16Str(j_axle,i_axle, "墙", BLUE, PINK);break;
             case 3:LCD_P16X16Str(j_axle,i_axle, "病", RED, PINK);break;
             case 4:LCD_P16X16Str(j_axle,i_axle, "囊", CYAN, PINK);break;
             case 5:LCD_P16X16Str(j_axle,i_axle, "人", WHITE, PINK);break;
             case 7:LCD_P16X16Str(j_axle,i_axle, "囊", GREEN, PINK);break;
             case 8:LCD_P16X16Str(j_axle,i_axle, "人", WHITE, PINK);break;
             #endif
             }
         }
     }
 };
void FreezeScreen()
{for( i_axle=0;i_axle<MAPX_MAX;i_axle++)
  { for( j_axle=0;j_axle<MAPY_MAX;j_axle++)
      {
          switch(mymap[i_axle][j_axle])
          {
            #ifdef   OLED_GAME
//            case 0:LCD_P16X16Str(j_axle,i_axle, "墙", HUI, PINK);break;
            case 1:LCD_P16X16Str(j_axle,i_axle, "墙", BLUE, PINK);break;
            case 3:LCD_P16X16Str(j_axle,i_axle, "病", CYAN, PINK);break;
            case 4:LCD_P16X16Str(j_axle,i_axle, "囊", CYAN, PINK);break;
            case 5:LCD_P16X16Str(j_axle,i_axle, "人", WHITE, PINK);break;
            case 7:LCD_P16X16Str(j_axle,i_axle, "囊", GREEN, PINK);break;
            case 8:LCD_P16X16Str(j_axle,i_axle, "人", WHITE, PINK);break;
            #endif
            }
        }
    }
}

void ClsCell(i_axle_rm,j_axle_rm)
{
        switch(mymap[i_axle_rm][j_axle_rm])
    {
      #ifdef   OLED_GAME
//        case 0:LCD_P16X16Str(j_axle,i_axle, "墙", HUI, PINK);break;
        case 1:LCD_P16X16Str(j_axle_rm,i_axle_rm, "墙", PINK, PINK);break;
        case 3:LCD_P16X16Str(j_axle_rm,i_axle_rm, "病", PINK, PINK);break;
        case 4:LCD_P16X16Str(j_axle_rm,i_axle_rm, "囊", PINK, PINK);break;
        case 5:LCD_P16X16Str(j_axle_rm,i_axle_rm, "人",PINK, PINK);break;
        case 7:LCD_P16X16Str(j_axle_rm,i_axle_rm, "囊", PINK, PINK);break;
        case 8:LCD_P16X16Str(j_axle_rm,i_axle_rm, "人", PINK, PINK);break;
      #endif
      }
}
void PrfCell(i_axle_Pf,j_axle_Pf)
{
        switch(mymap[i_axle_Pf][j_axle_Pf])
    {
      #ifdef   OLED_GAME
        case 1:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "墙", BLUE, PINK);break;
        case 3:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "病", RED, PINK);break;
        case 4:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "囊", CYAN, PINK);break;
        case 5:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "人", WHITE, PINK);break;
        case 7:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "囊", GREEN, PINK);break;
        case 8:LCD_P16X16Str(j_axle_Pf,i_axle_Pf, "人", WHITE, PINK);break;
      #endif
      }
}
void Guidance()
{
    LCD_CLS();
//    LCD_P6X8Str(1, 0, "Press s2 to freeze ", CYAN, BLACK);//显示英文6*8字符串
//    LCD_P6X8Str(1, 1, "full screen", CYAN, BLACK);//显示英文6*8字符串
    LCD_P16X16Str(2,0, "右侧进度条加", CYAN, SLIVER);
    LCD_P16X16Str(0,1, "载完时，游戏结束", CYAN, SLIVER);
    LCD_P16X16Str(2,2, "亮度高的环境", CYAN, SLIVER);
    LCD_P16X16Str(0,3, "将难以完成挑战", CYAN, SLIVER);

//    LCD_P16X16Str(3,1, "很遗憾", RED, SLIVER);
//    LCD_P16X16Str(3,1, "很遗憾", RED, SLIVER);

}
void play()
{  Guidance();//游戏说明书
    loop:
//    Guidance();//游戏说明书
    delay(1000);
    BarY=64;//初始化进度条
    //change map
    int mymap_new[MAPX_MAX][MAPY_MAX]=
    {
     {1,0,0,3,0,1,1},       //0 blank
     {1,0,4,5,0,1,1},       // 1 wall
     {1,3,1,4,0,1,1},       // 3 virus
     {1,0,4,0,3,1,1},       //4vaccine
      };
        for( i_axle=0;i_axle<MAPX_MAX;i_axle++)
            {for( j_axle=0;j_axle<MAPY_MAX;j_axle++)
                {
                    mymap[i_axle][j_axle]= mymap_new[i_axle][j_axle];
                }
              }
    //change map
//    LCD_CLS();
    LCD_display_full(PINK);
    paint();
    PersonX=1;
    PersonY=3;//初始位置
    GameState=1;
        while(mymap[2][1]!=7||mymap[0][3]!=7||mymap[3][4]!=7)
        {
            if(BarY<=0)
            {
                GameState=0;
                break;
            }
            delay(500);
            Progress_Bar();
            returnValue = bmi160_read_accel_xyz(&s_accelXYZ);//陀螺仪
            MAP_ADC14_toggleConversionTrigger();//控制小人移动速度
            curADCResultX = MAP_ADC14_getResult(ADC_MEM0);
            curADCResultY= MAP_ADC14_getResult(ADC_MEM1);
            if(curADCResultX>15000)
              {
                if(mymap[PersonX][PersonY+1]==0||mymap[PersonX][PersonY+1]==3)
                  {
                    ClsCell(PersonX,PersonY);
                    ClsCell(PersonX,PersonY+1);
                    mymap[PersonX][PersonY]-=5;
                    mymap[PersonX][PersonY+1]+=5;
                    PrfCell(PersonX,PersonY);
                    PrfCell(PersonX,PersonY+1);
                    PersonY++;
                    }
             else if((mymap[PersonX][PersonY+1]==4||mymap[PersonX][PersonY+1]==7)&&(mymap[PersonX][PersonY+2]==0||mymap[PersonX][PersonY+2]==3))
                       {
                     ClsCell(PersonX,PersonY);
                     ClsCell(PersonX,PersonY+1);
                     ClsCell(PersonX,PersonY+2);
                      mymap[PersonX][PersonY]-=5;
                      mymap[PersonX][PersonY+1]+=1;
                      mymap[PersonX][PersonY+2]+=4;
                      PrfCell(PersonX,PersonY);
                      PrfCell(PersonX,PersonY+1);
                      PrfCell(PersonX,PersonY+2);
                       PersonY++;

