Yusugarzjh/Yu_msp432/真源码/my_source.h
                       }
//                paint();
                }
             else if(curADCResultX<1000)//left||s_accelXYZ.x>10000
             {
                 if(PersonY!=0)
                {

                    if(mymap[PersonX][PersonY-1]==0||mymap[PersonX][PersonY-1]==3)
                  {
                    ClsCell(PersonX,PersonY);
                    ClsCell(PersonX,PersonY-1);
                    mymap[PersonX][PersonY]-=5;
                    mymap[PersonX][PersonY-1]+=5;
                    PrfCell(PersonX,PersonY);
                    PrfCell(PersonX,PersonY-1);
                    PersonY--;
                    }
                else if((mymap[PersonX][PersonY-1]==4||mymap[PersonX][PersonY-1]==7)&&(mymap[PersonX][PersonY-2]==0||mymap[PersonX][PersonY-2]==3))
                       {
                    ClsCell(PersonX,PersonY);
                    ClsCell(PersonX,PersonY-1);
                    ClsCell(PersonX,PersonY-2);
                      mymap[PersonX][PersonY]-=5;
                      mymap[PersonX][PersonY-1]+=1;
                      mymap[PersonX][PersonY-2]+=4;
                      PrfCell(PersonX,PersonY);
                      PrfCell(PersonX,PersonY-1);
                      PrfCell(PersonX,PersonY-2);
                      PersonY--;
                     }
                }
             }
//                    paint();

            else if(curADCResultY>15000)//down||s_accelXYZ.y>6000
            {
                if(mymap[PersonX+1][PersonY]==0||mymap[PersonX+1][PersonY]==3)
                  {
                    ClsCell(PersonX,PersonY);
                    ClsCell(PersonX+1,PersonY);
                    mymap[PersonX][PersonY]-=5;
                  mymap[PersonX+1][PersonY]+=5;
                  PrfCell(PersonX,PersonY);
                  PrfCell(PersonX+1,PersonY);
                    PersonX++;
                    }
                     else if((mymap[PersonX+1][PersonY]==4||mymap[PersonX+1][PersonY]==7)&&(mymap[PersonX+2][PersonY]==0||mymap[PersonX+2][PersonY]==3))
                       {
                         ClsCell(PersonX,PersonY);
                         ClsCell(PersonX+1,PersonY);
                         ClsCell(PersonX+2,PersonY);
                      mymap[PersonX][PersonY]-=5;
                      mymap[PersonX+1][PersonY]+=1;
                      mymap[PersonX+2][PersonY]+=4;
                      PrfCell(PersonX,PersonY);
                      PrfCell(PersonX+1,PersonY);
                      PrfCell(PersonX+2,PersonY);
                       PersonX++;
                       }
//                paint();
              }
          else if (curADCResultY<1000)//up||s_accelXYZ.y<-6000
            {
              if(PersonX==2||PersonX==3||(PersonX==1&&(mymap[0][PersonY]==0||mymap[0][PersonY]==3)))
              {
               if(mymap[PersonX-1][PersonY]==0||mymap[PersonX-1][PersonY]==3)
                  {
                   ClsCell(PersonX,PersonY);
                   ClsCell(PersonX-1,PersonY);
                    mymap[PersonX][PersonY]-=5;
                    mymap[PersonX-1][PersonY]+=5;
                    PrfCell(PersonX,PersonY);
                    PrfCell(PersonX-1,PersonY);
                    PersonX--;
                    }
               else if((mymap[PersonX-1][PersonY]==4||mymap[PersonX-1][PersonY]==7)&&(mymap[PersonX-2][PersonY]==0||mymap[PersonX-2][PersonY]==3))
                   {
                   ClsCell(PersonX,PersonY);
                   ClsCell(PersonX-1,PersonY);
                   ClsCell(PersonX-2,PersonY);
                     mymap[PersonX][PersonY]-=5;
                     mymap[PersonX-1][PersonY]+=1;
                     mymap[PersonX-2][PersonY]+=4;
                     PrfCell(PersonX,PersonY);
                     PrfCell(PersonX-1,PersonY);
                     PrfCell(PersonX-2,PersonY);
                     PersonX--;
                    }
//               paint();
                  }
              }
          else if(s_accelXYZ.z<-15000)
          {
            goto loop;
          }

        }
}


void Stick()
{
        LCD_draw_dot(stick_x,stick_y,RED);
        LCD_draw_dot(stick_x,stick_y+1,RED);
        LCD_draw_dot(stick_x,stick_y-1,RED);
        LCD_draw_dot(stick_x+1,stick_y,RED);
        LCD_draw_dot(stick_x-1,stick_y,RED);
            LCD_draw_dot(64,32,RED);
    while(1)
    {
            delay(0);
            MAP_ADC14_toggleConversionTrigger();//手动开启ADC转换
            curADCResultX = MAP_ADC14_getResult(ADC_MEM0);
            curADCResultY= MAP_ADC14_getResult(ADC_MEM1);
            if(curADCResultX>15000)
              {
                    stick_x++;
                    LCD_draw_dot(stick_x-1,stick_y,BLACK);
                    LCD_draw_dot(stick_x-1+1,stick_y,BLACK);
                    LCD_draw_dot(stick_x-1-1,stick_y,BLACK);
                    LCD_draw_dot(stick_x-1,stick_y-1,BLACK);
                    LCD_draw_dot(stick_x-1,stick_y+1,BLACK);
                    LCD_draw_dot(stick_x,stick_y,RED);
                    LCD_draw_dot(stick_x,stick_y+1,RED);
                    LCD_draw_dot(stick_x,stick_y-1,RED);
                    LCD_draw_dot(stick_x+1,stick_y,RED);
                    LCD_draw_dot(stick_x-1,stick_y,RED);

                }
             else if(curADCResultX<1000)
             {
                 stick_x--;
                 LCD_draw_dot(stick_x+1,stick_y,BLACK);
                 LCD_draw_dot(stick_x+1,stick_y+1,BLACK);
                 LCD_draw_dot(stick_x+1,stick_y-1,BLACK);
                 LCD_draw_dot(stick_x+1+1,stick_y,BLACK);
                 LCD_draw_dot(stick_x+1-1,stick_y,BLACK);
                 LCD_draw_dot(stick_x,stick_y,RED);
                 LCD_draw_dot(stick_x,stick_y+1,RED);
                 LCD_draw_dot(stick_x,stick_y-1,RED);
                 LCD_draw_dot(stick_x+1,stick_y,RED);
                 LCD_draw_dot(stick_x-1,stick_y,RED);
              }
            else if(curADCResultY>15000)
            {
                stick_y++;
                LCD_draw_dot(stick_x,stick_y-1,BLACK);
                LCD_draw_dot(stick_x,stick_y-1+1,BLACK);
                LCD_draw_dot(stick_x,stick_y-1-1,BLACK);
                LCD_draw_dot(stick_x+1,stick_y-1,BLACK);
                LCD_draw_dot(stick_x-1,stick_y-1,BLACK);
                LCD_draw_dot(stick_x,stick_y,RED);
                LCD_draw_dot(stick_x,stick_y+1,RED);
                LCD_draw_dot(stick_x,stick_y-1,RED);
                LCD_draw_dot(stick_x+1,stick_y,RED);
                LCD_draw_dot(stick_x-1,stick_y,RED);
              }
          else if (curADCResultY<1000)
            {
              stick_y--;
              LCD_draw_dot(stick_x,stick_y+1,BLACK);
              LCD_draw_dot(stick_x,stick_y+1+1,BLACK);
              LCD_draw_dot(stick_x,stick_y+1-1,BLACK);
              LCD_draw_dot(stick_x+1,stick_y+1,BLACK);
              LCD_draw_dot(stick_x-1,stick_y+1,BLACK);
              LCD_draw_dot(stick_x,stick_y,RED);
              LCD_draw_dot(stick_x,stick_y+1,RED);
              LCD_draw_dot(stick_x,stick_y-1,RED);
              LCD_draw_dot(stick_x+1,stick_y,RED);
              LCD_draw_dot(stick_x-1,stick_y,RED);
              }

