Yusugarzjh/Yu_msp432/真源码/my_source.h
    }
};
void StickAccel()
{
        LCD_draw_dot(stick_x,stick_y,RED);
        LCD_draw_dot(stick_x,stick_y+1,RED);
        LCD_draw_dot(stick_x,stick_y-1,RED);
        LCD_draw_dot(stick_x+1,stick_y,RED);
        LCD_draw_dot(stick_x-1,stick_y,RED);
            LCD_draw_dot(64,32,RED);
    while(1)
    {
            delay(200);
            returnValue = bmi160_read_accel_xyz(&s_accelXYZ);//陀螺仪
           snprintf(test.txString, 60,"x:\%d,y:\%d,z:\%d\r\n",s_accelXYZ.x, s_accelXYZ.y, s_accelXYZ.z);
           sendTextPc();
           sendTextEsp();
            if(s_accelXYZ.x<-15000)
              {
                    stick_x++;
                    MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
                    MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
//                    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
                    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN1);
//                    LCD_draw_dot(stick_x-1,stick_y,BLACK);
//                    LCD_draw_dot(stick_x-1+1,stick_y,BLACK);
//                    LCD_draw_dot(stick_x-1-1,stick_y,BLACK);
//                    LCD_draw_dot(stick_x-1,stick_y-1,BLACK);
//                    LCD_draw_dot(stick_x-1,stick_y+1,BLACK);
                    LCD_draw_dot(stick_x,stick_y,RED);
                    LCD_draw_dot(stick_x,stick_y+1,RED);
                    LCD_draw_dot(stick_x,stick_y-1,RED);
                    LCD_draw_dot(stick_x+1,stick_y,RED);
                    LCD_draw_dot(stick_x-1,stick_y,RED);

                }
             else if(s_accelXYZ.x>5000)
             {
                 stick_x--;
                 MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
                 MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
//                 MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
                 MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN1);
//                 LCD_draw_dot(stick_x+1,stick_y,BLACK);
//                 LCD_draw_dot(stick_x+1,stick_y+1,BLACK);
//                 LCD_draw_dot(stick_x+1,stick_y-1,BLACK);
//                 LCD_draw_dot(stick_x+1+1,stick_y,BLACK);
//                 LCD_draw_dot(stick_x+1-1,stick_y,BLACK);
                 LCD_draw_dot(stick_x,stick_y,RED);
                 LCD_draw_dot(stick_x,stick_y+1,RED);
                 LCD_draw_dot(stick_x,stick_y-1,RED);
                 LCD_draw_dot(stick_x+1,stick_y,RED);
                 LCD_draw_dot(stick_x-1,stick_y,RED);
              }
            else if(s_accelXYZ.y>15000)
            {
                stick_y++;
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
                MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
                MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN2);
//                LCD_draw_dot(stick_x,stick_y-1,BLACK);
//                LCD_draw_dot(stick_x,stick_y-1+1,BLACK);
//                LCD_draw_dot(stick_x,stick_y-1-1,BLACK);
//                LCD_draw_dot(stick_x+1,stick_y-1,BLACK);
//                LCD_draw_dot(stick_x-1,stick_y-1,BLACK);
                LCD_draw_dot(stick_x,stick_y,RED);
                LCD_draw_dot(stick_x,stick_y+1,RED);
                LCD_draw_dot(stick_x,stick_y-1,RED);
                LCD_draw_dot(stick_x+1,stick_y,RED);
                LCD_draw_dot(stick_x-1,stick_y,RED);
              }
          else if (s_accelXYZ.y<0)
            {
              stick_y--;
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
              MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN2);
//              LCD_draw_dot(stick_x,stick_y+1,BLACK);
//              LCD_draw_dot(stick_x,stick_y+1+1,BLACK);
//              LCD_draw_dot(stick_x,stick_y+1-1,BLACK);
//              LCD_draw_dot(stick_x+1,stick_y+1,BLACK);
//              LCD_draw_dot(stick_x-1,stick_y+1,BLACK);
              LCD_draw_dot(stick_x,stick_y,RED);
              LCD_draw_dot(stick_x,stick_y+1,RED);
              LCD_draw_dot(stick_x,stick_y-1,RED);
              LCD_draw_dot(stick_x+1,stick_y,RED);
              LCD_draw_dot(stick_x-1,stick_y,RED);
              }
          else if(s_accelXYZ.z<0)
          {
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
              break;
          }
          else
          {
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
              MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
          }
    }
}

#endif /* MY_SOURCE_H_ */
